[{"Name":"Custommizations","ExampleInfo":{"Name":"Custommizations","ProjectPath":"C:\\Work\\WPF_Scrum\\Release\\SDK\\Examples\\MaskedInput\\Custommizations\\MaskCustomizations.csproj","ReadmePath":"C:\\Work\\WPF_Scrum\\Release\\SDK\\Examples\\MaskedInput\\Custommizations\\ReadMe.md","DirectoryName":"Custommizations","ExampleFileNames":["MaskCustomizations.csproj","App.config","App.xaml","App.xaml.cs","CustomizationsViewModel.cs","Example.xaml","Example.xaml.cs","FirstCharCapitalFormatToken.cs","MainWindow.xaml","MainWindow.xaml.cs"]},"GitHubPath":"https://api.github.com/repos/telerik/xaml-sdk/contents/MaskedInput/Custommizations/","Description":"This example demonstrates how the masked input control can be customized.\r\n\tThe Bank Account RadMaskedCurrencyInput uses a customized culture to represent its value as a Bank Input form. The modified culture changes the CurrencyGroupSizes and the CurrencyGroupSeparator.\r\n\tThe Full Name RadMaskedTextInput uses a multiline mask with embedded text to enable first and last name input. It also uses a customized formatting token, which converts the first character of each name section to a capital one.\r\nThe three masked input controls also use different kinds of validation - through Data Annotation attributes, intrinsic Validation and custom.","KeyWords":"Custommizations,  custommizations, imodifiertokenvalidationrule, maskedcurrencyinput, maskedtextinput, databinding, mvvm, addcustomvalidationrule, validationexception"},
{"Name":"Data Validation","ExampleInfo":{"Name":"Data Validation","ProjectPath":"C:\\Work\\WPF_Scrum\\Release\\SDK\\Examples\\MaskedInput\\DataValidation\\DataValidation_WPF.csproj","ReadmePath":"C:\\Work\\WPF_Scrum\\Release\\SDK\\Examples\\MaskedInput\\DataValidation\\ReadMe.md","DirectoryName":"DataValidation","ExampleFileNames":["DataValidation_WPF.csproj","App.config","App.xaml","App.xaml.cs","DataErrorViewModel.cs","Example.xaml","Example.xaml.cs","MainWindow.xaml","MainWindow.xaml.cs","ValidationExceptionsViewModel.cs"]},"GitHubPath":"https://api.github.com/repos/telerik/xaml-sdk/contents/MaskedInput/DataValidation/","Description":"The DataValidation SDK sample of the MaskedInput Controls demonstrates how you can:\r\n\r\n* Validate the data value on load with IDataErrorInfo\r\n* Validate with throwing DataExceptions  \r\n* Validate with using Data Annotations","KeyWords":"Data Validation,  radmaskednumericinput, databinding, mvvm, idataerrorinfo, datavalidation, validatesondataerrors, validationexceptions"},
{"Name":"Dynamic Format String","ExampleInfo":{"Name":"Dynamic Format String","ProjectPath":"C:\\Work\\WPF_Scrum\\Release\\SDK\\Examples\\MaskedInput\\DynamicFormatString\\DynamicFormatString_WPF.csproj","ReadmePath":"C:\\Work\\WPF_Scrum\\Release\\SDK\\Examples\\MaskedInput\\DynamicFormatString\\Readme.md","DirectoryName":"DynamicFormatString","ExampleFileNames":["DynamicFormatString_WPF.csproj","App.config","App.xaml","App.xaml.cs","CustomNumericInput.cs","Example.xaml","Example.xaml.cs","MainWindow.xaml","MainWindow.xaml.cs","Readme.md"]},"GitHubPath":"https://api.github.com/repos/telerik/xaml-sdk/contents/MaskedInput/DynamicFormatString/","Description":"Users often need to type doubles like 1.234, 56.78, 123.9 and they do NOT need to see these values to be completed with zeros like:\r\n\r\n* 1.23400\r\n* 56.7800\r\n* 123.90000\r\n\r\nTo achieve this effect users can users can use No-Mask (Mask=\"\") and update the FormatString property runtime. Furthermore, users need delete and backspace keys to not produce zeros.\r\nFor example pressing delete here 12.3|45 to produce 12.35 but not 12.305. This is demonstrated in the sample with overriding the HandleBackKeyNomask and HandleDeleteKeyNoMask methods of the RadMaskedNumericInput.\r\nFinally, it is good idea to limit the input somehow both on the left and on the right of  the decimal point because double loses precision after 15 digits.","KeyWords":"Dynamic Format String,  dynamicformatstring, maskedinputextensions, maskednumericinput, custom, maximumdigitsonright"},
{"Name":"Ip Address","ExampleInfo":{"Name":"Ip Address","ProjectPath":"C:\\Work\\WPF_Scrum\\Release\\SDK\\Examples\\MaskedInput\\IpAddress\\IpAddress_WPF.csproj","ReadmePath":"C:\\Work\\WPF_Scrum\\Release\\SDK\\Examples\\MaskedInput\\IpAddress\\Readme.md","DirectoryName":"IpAddress","ExampleFileNames":["IpAddress_WPF.csproj","app.config","App.xaml","App.xaml.cs","Example.xaml","Example.xaml.cs","IpAddressPresentation.cs","IpPresentationToStringConverter.cs","MainWindow.xaml","MainWindow.xaml.cs","Readme.md","ViewModel.cs"]},"GitHubPath":"https://api.github.com/repos/telerik/xaml-sdk/contents/MaskedInput/IpAddress/","Description":"The IP address demo shows how you can set up an IpAddressViewModel and validate it on user Input. The IpAddressViewModel validates with separating the 4 parts into 4 byte properties and also validates with System.Net.IpAddress class.","KeyWords":"Ip Address,  ipaddress, databinding, mvvm, validatesonexceptions, maskedtextinput, validation"},
{"Name":"Minus Key Customizations","ExampleInfo":{"Name":"Minus Key Customizations","ProjectPath":"C:\\Work\\WPF_Scrum\\Release\\SDK\\Examples\\MaskedInput\\MinusKeyCustomizations\\MinusKeyCustomizations_WPF.csproj","ReadmePath":"C:\\Work\\WPF_Scrum\\Release\\SDK\\Examples\\MaskedInput\\MinusKeyCustomizations\\Readme.md","DirectoryName":"MinusKeyCustomizations","ExampleFileNames":["MinusKeyCustomizations_WPF.csproj","App.config","App.xaml","App.xaml.cs","Example.xaml","Example.xaml.cs","MainWindow.xaml","MainWindow.xaml.cs","NumericInputMinusClearsSelection.cs","NumericInputMinusDeletable.cs","Readme.md"]},"GitHubPath":"https://api.github.com/repos/telerik/xaml-sdk/contents/MaskedInput/MinusKeyCustomizations/","Description":"MinusKeyCustomizations SDK sample shows how to use the negative sign symbol in custom, non- default way.\r\nPlease note that although the code shows RadMaskedNumericInput and its custom subclasses, the same approach can be used for RadMaskedCurrencyInput.\r\n* The first control in the demo is RadMaskedNumericInput with AllowMinusOnNullValues set to true. This allows you to press OemMinus / Subtract key on the keyboard when the value is null resulting in entering negative sign symbol before entering any digits. \r\n\r\n* The second control in the demo is custom RadMaskedNumericInput which allows you to select all and press OemMinus / Subtract key resulting in clearing the value and entering negative sign. This is achieved with overriding HandleSubtractkey method of RadMaskedNumericInput. \r\n\r\n* The third control in the demo is custom RadMaskedNumericInput which allows you to delete the negative sign symbol with Backspace / Delete keys on the keyboard. This is achieved with overriding CanModifyChar, HandleBackKeyNoMask and HandleDeleteKeyNoMaks methods of the RadMaskedNumericInput.","KeyWords":"Minus Key Customizations,  minuskeycustomizations, maskednumericinput, allowminusonnullvalues, databinding, mvvm, maskedinputextensions"},
{"Name":"Value To Text Converter","ExampleInfo":{"Name":"Value To Text Converter","ProjectPath":"C:\\Work\\WPF_Scrum\\Release\\SDK\\Examples\\MaskedInput\\ValueToTextConverter\\ValueToTextConverter.csproj","ReadmePath":"C:\\Work\\WPF_Scrum\\Release\\SDK\\Examples\\MaskedInput\\ValueToTextConverter\\ReadMe.md","DirectoryName":"ValueToTextConverter","ExampleFileNames":["ValueToTextConverter.csproj","App.config","App.xaml","App.xaml.cs","Example.xaml","Example.xaml.cs","MainWindow.xaml","MainWindow.xaml.cs","Converters\\NumericToTextConverter.cs","Converters\\StringValueToTextConverter.cs"]},"GitHubPath":"https://api.github.com/repos/telerik/xaml-sdk/contents/MaskedInput/ValueToTextConverter/","Description":"This example demonstrates the usage of an IValueConverter to convert and customize the Value into Display Text.","KeyWords":"Value To Text Converter,  valuetotextconverter, maskednumericinput, maskedcurrencyinput, maskedtextinput, valuetotextconverter, displaytext"}]